const moment = require("moment-timezone");

module.exports = {
  command: ["menu", "help", "ayuda"],
  description: "Muestra el menú principal con video o gif",
  category: "general",
  run: async (client, m, args) => {
    const jam = moment.tz("America/Argentina/Buenos_Aires").format("HH:mm:ss");
    const saludo =
      jam < "05:00:00"
        ? "🄵𝖾𝗅𝗂𝗓 🄼𝖺𝖽𝗋𝗎𝗀𝖺𝖽𝖺 🌟"
        : jam < "11:00:00"
        ? "🄱𝗎𝖾𝗇 🄳𝗂́𝖺 🌤"
        : jam < "15:00:00"
        ? "🄵𝖾𝗅𝗂𝗓 🅂𝗂𝖾𝗌𝗍𝖺 ⛅"
        : jam < "19:00:00"
        ? "🄱𝗎𝖾𝗇𝖺𝗌 🅃𝖺𝗋𝖽𝖾𝗌 🌆"
        : jam < "20:00:00"
        ? "🄱𝗎𝖾𝗇𝖺𝗌 🄽𝗈𝖼𝗁𝖾𝗌 🌙";

    
    const fkontak = {
      key: {
        participant: "0@s.whatsapp.net",
        ...(m.chat ? { remoteJid: "status@broadcast" } : {}),
      },
      message: {
        contactMessage: {
          displayName: `${m.pushName || "Usuario"}`,
          vcard: `BEGIN:VCARD\nVERSION:3.0\nN:XL;${m.pushName || "Usuario"};;;\nFN:${m.pushName || "Usuario"}\nitem1.TEL;waid=${
            m.sender.split("@")[0]
          }:${m.sender.split("@")[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD`,
        },
      },
    };
    
 await m.react("🦇");
    
    const textoMenu = `
${saludo}, 𝖲𝗈𝗒 ${namebot}

\`💋 𝖴𝗌𝗎𝖺𝗋𝗂𝗈:\` *${m.pushName || "Usuario"}*
\`🔥 𝖵𝖾𝗋𝗌𝗂𝗈𝗇:\` ${version}


\`.  . ︵ 𝖦𝖤𝖭𝖤𝖱𝖠𝖫.  ◌Ⳋ𝅄\`

˙.꒷🩸.𖦹˙ іᥒ𝖿᥆
˙.꒷🩸.𖦹˙ mᥱᥒᥙ
˙.꒷🩸.𖦹˙ ⍴іᥒg
˙.꒷🩸.𖦹˙ ᥣіძ

\`.  . ︵ 𝖣𝖮𝖶𝖭𝖫𝖮𝖠𝖣𝖤𝖱.  ◌Ⳋ𝅄\`

˙.꒷🦇.𖦹˙ ძrі᥎ᥱ
˙.꒷🦇.𖦹˙ ძr᥆⍴ᑲ᥆᥊
˙.꒷🦇.𖦹˙ 𝖿ᑲ
˙.꒷🦇.𖦹˙ mᥱძіᥲ𝖿іrᥱ
˙.꒷🦇.𖦹˙ ⍴ᥣᥲᥡᥲᥙძі᥆
˙.꒷🦇.𖦹˙ ⍴ᥣᥲᥡ᥎іძᥱ᥆
˙.꒷🦇.𖦹˙ s⍴᥆𝗍і𝖿ᥡ
˙.꒷🦇.𖦹˙ 𝗍іk𝗍᥆k
˙.꒷🦇.𖦹˙ 𝗍ᥕі𝗍𝗍ᥱr

\`.  . ︵ 𝖦𝖱𝖮𝖴𝖯𝖲.  ◌Ⳋ𝅄\`

˙.꒷🩸.𖦹˙ ᥴᥣ᥆sᥱ
˙.꒷🩸.𖦹˙ ᥆⍴ᥱᥒ
˙.꒷🩸.𖦹˙ ᥣіᥒk
˙.꒷🩸.𖦹˙ ძᥱᥣ
˙.꒷🩸.𖦹˙ ძᥱm᥆rᥱ
˙.꒷🩸.𖦹˙ ⍴r᥆m᥆𝗍ᥱ
˙.꒷🩸.𖦹˙ һіძᥱ𝗍ᥲg
˙.꒷🩸.𖦹˙ іᥒ𝖿᥆grᥙ⍴᥆
˙.꒷🩸.𖦹˙ kіᥴk
˙.꒷🩸.𖦹˙ kіᥴkᥲᥣᥣ
˙.꒷🩸.𖦹˙ ᥆ᥒ
˙.꒷🩸.𖦹˙ rᥱ᥎᥆kᥱ
˙.꒷🩸.𖦹˙ sᥱ𝗍ძᥱsᥴ
˙.꒷🩸.𖦹˙ sᥱ𝗍ᥒᥲmᥱ
˙.꒷🩸.𖦹˙ 𝗍᥆ძ᥆s

\`.  . ︵ 𝖥𝖴𝖭.  ◌Ⳋ𝅄\`

˙.꒷🦇.𖦹˙ gᥲᥡ
˙.꒷🦇.𖦹˙ ȷᥲᥣᥲmᥱ
˙.꒷🦇.𖦹˙ 𝖿᥆rmᥲr⍴ᥲrᥱȷᥲ5
˙.꒷🦇.𖦹˙ 𝖿rᥲsᥱ
˙.꒷🦇.𖦹˙ ᥒ᥆mᑲrᥱᥒіᥒȷᥲ
˙.꒷🦇.𖦹˙ ⍴іr᥆⍴᥆

\`.  . ︵ 𝖠𝖭𝖨𝖬𝖤.  ◌Ⳋ𝅄\`

˙.꒷🩸.𖦹˙ ᥲᥒgrᥡ
˙.꒷🩸.𖦹˙ ძᥲᥒᥴᥱ
˙.꒷🩸.𖦹˙ һᥲ⍴⍴ᥡ
˙.꒷🩸.𖦹˙ һᥱᥣᥣ᥆
˙.꒷🩸.𖦹˙ һᥙg
˙.꒷🩸.𖦹˙ kіss
˙.꒷🩸.𖦹˙ ᥣ᥆᥎ᥱ
˙.꒷🩸.𖦹˙ sᥲძ

\`.  . ︵ 𝖳𝖮𝖮𝖫𝖲.  ◌Ⳋ𝅄\`

˙.꒷🦇.𖦹˙ ᥴᥲᥣ
˙.꒷🦇.𖦹˙ ᥴᥣіmᥲ
˙.꒷🦇.𖦹˙ һ᥆rᥲrі᥆
˙.꒷🦇.𖦹˙ ᥣᥱ𝗍rᥲ

\`.  . ︵ 𝖲𝖳𝖨𝖢𝖪𝖤𝖱𝖲.  ◌Ⳋ𝅄\`

˙.꒷🩸.𖦹˙ s𝗍іᥴkᥱr

\`.  . ︵ 𝖮𝖶𝖭𝖤𝖱.  ◌Ⳋ𝅄\`

˙.꒷🦇.𖦹˙ ᥲᥙ𝗍᥆ᥲძmіᥒ
˙.꒷🦇.𖦹˙ kіᥴk2
˙.꒷🦇.𖦹˙ ᥙ⍴ძᥲ𝗍ᥱ

`.trim();

    const videoUrl = "https://files.catbox.moe/wacw2i.mp4"; 

    await client.sendMessage(
      m.chat,
      {
        video: { url: videoUrl },
        caption: textoMenu,
        gifPlayback: true, 
        contextInfo: {
          forwardingScore: 1,
          isForwarded: true,
          forwardedNewsletterMessageInfo: {
            newsletterJid: my.ch,
            serverMessageId: "1",
            newsletterName: my.name1,
          },
          externalAdReply: {
            title: `${namebot}`,
          //  body: `${dev}`,
            thumbnailUrl: "https://files.catbox.moe/psvfzq.jpg", 
            sourceUrl: "https://draculaura.vercel.app", 
            mediaType: 1,
            renderLargerThumbnail: false,
          },
        },
      },
      { quoted: fkontak }
    );
  },
};
